# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Panama')

STATES = [
    (1, _('Bocas del Toro'), 254, 115, 314, -20),
    (2, _('Coclé'), 253, 349, 367, 0),
    (3, _('Colón'), 252, 331, 300, 30),
    (4, _('Chiriquí'), 251, 111, 368, 0),
    (5, _('Darién'), 250, 689, 415, 0),
    (6, _('Herrera'), 249, 314, 449, 60),
    (7, _('Los Santos'), 248, 375, 490, 30),
    (8, _('Panamá'), 247, 501, 281, 0),
    (9, _('Veraguas'), 246, 255, 400, 0),
    (10, _('Colombia'), 245, 761, 525, 90),
    (11, _('Costa Rica'), 244, 11, 281, 90),
    (12, _('San Blas'), 243, 638, 251, -20),
    (13, _('Is. Coiba'), 242, 175, 501, 0),
    (14, _('Is. del Rey'), 241, 545, 385, 0)
]

CAPITALS = [
    (15, _('Panamá'), 468, 297, 0, 0, -14),
    (16, _('Bocas del Toro'), 115, 250, 1, 40, -14),
    (17, _('Chitré'), 348, 435, 1, -25, 14),
    (18, _('Colón'), 420, 258, 1, -15, -14),
    (19, _('David'), 93, 374, 1, 0, 14),
    (20, _('El Porvenir'), 542, 228, 1, 20, -14),
    (21, _('La Palma'), 645, 380, 1, 0, -14),
    (22, _('Las Tablas'), 371, 461, 1, -20, 14),
    (23, _('Penonomé'), 360, 365, 1, 0, 14),
    (24, _('Santiago'), 280, 416, 1, 0, 14)
]

CITIES = [
    (25, _('Aguadulce'), 335, 399, 2, 25, 14),
    (26, _('Almirante'), 98, 260, 2, 0, 14),
    (27, _('Bajo Boquete'), 91, 331, 2, 60, 0),
    (28, _('Balboa'), 463, 306, 2, 20, 14),
    (29, _('Cañita'), 550, 271, 2, 30, 0),
    (30, _('Cerro Punta'), 74, 319, 2, 0, -14),
    (31, _('Chepo'), 522, 278, 2, -25, -14),
    (32, _('El Copé'), 328, 351, 2, 0, -14),
    (33, _('El Tigre'), 247, 473, 2, -25, -14),
    (34, _('El Valle'), 389, 353, 2, 15, -14),
    (35, _('Elena'), 49, 226, 2, -10, -14),
    (36, _('La Chorrera'), 435, 316, 2, -45, -14),
    (37, _('Los Asientos'), 390, 494, 2, 0, 14),
    (38, _('Portobelo'), 451, 228, 2, -10, -14),
    (39, _('Puerto Armuelles'), 36, 391, 2, 40, 14),
    (40, _('Salud'), 389, 275, 2, -25, -14),
    (41, _('San Andrés'), 57, 354, 2, -10, -14),
    (42, _('Santa Fe'), 264, 364, 2, -10, -14),
    (43, _('Soloy'), 136, 357, 2, 15, 14),
    (44, _('Tolé'), 189, 400, 2, 0, -14),
    (45, _('Yaviza'), 704, 406, 2, 0, 14)
]

RIVERS = [
    (46, _('Changuinola River'), 254, 74, 283, -70),
    (47, _('San Pablo River'), 253, 219, 399, -70),
    (48, _('Santa María River'), 252, 295, 397, -20),
    (49, _('Indio River'), 251, 372, 314, -80),
    (50, _('Panamá Canal'), 250, 449, 290, -50),
    (51, _('Chepo River'), 249, 517, 281, 45),
    (52, _('Lake Bayano'), 248, 573, 275, 45),
    (53, _('Chucunaque River'), 247, 686, 340, -60),
    (54, _('Balsas River'), 246, 673, 458, -70),
    (55, _('Tuira River'), 245, 735, 435, -60),
    (56, _('Charco Azul Bay'), 244, 63, 410, 90),
    (57, _('Gulf of Montijo'), 243, 266, 503, 0),
    (58, _('Gulf of Chiriqui'), 242, 137, 439, -40),
    (59, _('Parita Bay'), 241, 366, 413, 90),
    (60, _('Gulf of San Miguel'), 240, 609, 398, 0),
    (61, _('Gulf of Panamá'), 239, 493, 441, 0),
    (62, _('Gulf of San Blas'), 238, 558, 231, 0),
    (63, _('Lake Gatún'), 237, 415, 274, -50),
    (64, _('Chiriqui Lagoon'), 236, 141, 295, -60),
    (65, _('Gulf of the Mosquitos'), 235, 247, 295, -45),
    (66, _('Caribbean Sea'), 234, 381, 126, 0),
    (67, _('Pacific Ocean'), 233, 346, 682, 0)
]

ROUTES = []

STATS = [
    (_('Capital:'), _('Panamá') + ' ' + _("(8º58' N - 79º32' W)")),
    (_('Language:'), _('Spanish')),
    (_('Government:'), _('Presidential republic')),
    (_('President:'), _('José Raúl Mulino')),
    (_('Vice President:'), _('Vacant')),
    (_('Independence:'), _('from Spain')),
    ('', _('November 28, 1821')),
    (_('from Colombia:'), _('November 3, 1903')),
    (_('Area:'), '78 200' + ' ' + _('km²')),
    (_('Population:'), '4 571 189 (2025)'),
    (_('GDP:'), 'USD 90 460 000 000 (2025)'),
    (_('HDI:'), _('Very High') + ' - 0.839 (2023, #59)'),
    (_('Currency:'), _('Balboa')),
    (_('Updated:'), '2026-09-25'),
]

