# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Bolivia')

STATES = [
    (1, _('Pando'), 254, 136, 124, 0),
    (2, _('Beni'), 253, 283, 292, 0),
    (3, _('La Paz'), 252, 124, 431, 0),
    (4, _('Oruro'), 251, 146, 609, 0),
    (5, _('Potosí'), 250, 204, 745, 0),
    (6, _('Cochabamba'), 249, 279, 503, 0),
    (7, _('Chuquisaca'), 248, 377, 730, 0),
    (8, _('Tarija'), 247, 374, 788, 0),
    (9, _('Santa Cruz'), 246, 529, 513, 0),
    (10, _('Brazil'), 245, 552, 109, 0),
    (11, _('Perú'), 244, 23, 271, 90),
    (12, _('Chile'), 243, 50, 763, 90),
    (13, _('Paraguay'), 242, 616, 800, 0),
    (14, _('Argentina'), 241, 331, 884, 0)
]

CAPITALS = [
    (15, _('La Paz'), 118, 464, 0, 0, -14),
    (16, _('Cobija'), 66, 104, 1, 0, 14),
    (17, _('Trinidad'), 318, 352, 1, 0, -14),
    (18, _('Cochabamba'), 244, 519, 1, 0, -14),
    (19, _('Oruro'), 193, 557, 1, -10, 14),
    (20, _('Potosí'), 272, 662, 1, 0, 14),
    (21, _('Sucre'), 305, 626, 1, 0, -14),
    (22, _('Tarija'), 342, 789, 1, 0, 14),
    (23, _('Santa Cruz'), 430, 544, 1, 0, 14)
]

CITIES = [
    (24, _('Apolo'), 86, 356, 2, 0, -14),
    (25, _('Reyes'), 159, 323, 2, 10, -14),
    (26, _('Santa Ana'), 277, 280, 2, 0, -14),
    (27, _('San Borja'), 202, 355, 2, 0, -14),
    (28, _('Puerto Heath'), 79, 204, 2, 0, 14),
    (29, _('Asunción'), 124, 160, 2, 0, -14),
    (30, _('Riberalta'), 238, 104, 2, -15, -14),
    (31, _('Magdalena'), 366, 255, 2, 0, -14),
    (32, _('Loreto'), 330, 376, 2, 0, 14),
    (33, _('Puerto Acosta'), 48, 403, 2, 30, -14),
    (34, _('Caranavi'), 155, 419, 2, 0, 14),
    (35, _('Guaqui'), 77, 475, 2, -15, 14),
    (36, _('Ascención'), 435, 405, 2, 0, -14),
    (37, _('Concepción'), 500, 434, 2, 0, -14),
    (38, _('San Ignacio'), 563, 443, 2, 0, 14),
    (39, _('Tarabuco'), 324, 634, 2, 0, 14),
    (40, _('Aiquile'), 307, 569, 2, 0, -14),
    (41, _('Villazón'), 289, 816, 2, 15, 14),
    (42, _('Uyuni'), 209, 723, 2, 0, -14),
    (43, _('Yucuiba'), 407, 809, 2, 0, 14),
    (44, _('Villa Montes'), 421, 762, 2, 0, -14),
    (45, _('Camiri'), 409, 694, 2, 20, -14),
    (46, _('Santa Rosa del Sara'), 402, 497, 2, 15, -14),
    (47, _('Montero'), 425, 513, 2, 0, 14),
    (48, _('Las Petas'), 680, 449, 2, 0, 14),
    (49, _('San José de Chiquitos'), 583, 544, 2, 0, -14),
    (50, _('Roboré'), 643, 576, 2, 0, -14),
    (51, _('Puerto Suárez'), 758, 614, 2, -30, -14)
]

RIVERS = [
    (52, _('Pilcomayo River'), 254, 462, 796, -45),
    (53, _('Parapetí River'), 253, 444, 690, 30),
    (54, _('Sécure River'), 252, 260, 407, 30),
    (55, _('Ichoa River'), 251, 296, 434, 40),
    (56, _('Piray River'), 250, 406, 520, 90),
    (57, _('Ichilo River'), 249, 311, 470, 90),
    (58, _('Grande River'), 248, 461, 526, -80),
    (59, _('Yacuma River'), 247, 204, 302, 30),
    (60, _('Madre de Dios River'), 246, 133, 158, 40),
    (61, _('Desaguadero River'), 245, 96, 538, -40),
    (62, _('Grande de Lípez River'), 244, 171, 773, 90),
    (63, _('San Miguel River'), 243, 400, 392, -45),
    (64, _('San Martín River'), 242, 505, 332, -45),
    (65, _('Abuná River'), 241, 176, 41, 30),
    (66, _('Orton River'), 240, 188, 88, 20),
    (67, _('Madeira River'), 239, 209, 54, 30),
    (68, _('Madidi River'), 238, 123, 238, 30),
    (69, _('Tequeje River'), 237, 118, 275, 20),
    (70, _('Beni River'), 236, 166, 299, 60),
    (71, _('Viata River'), 235, 207, 213, 70),
    (72, _('Apere River'), 234, 260, 338, 30),
    (73, _('Mamoré River'), 233, 338, 346, -80),
    (74, _('Blanco River'), 232, 474, 366, -50),
    (75, _('Paraguá River'), 231, 575, 351, -70),
    (76, _('Guaporé River'), 230, 524, 244, -25),
    (77, _('Tucavaca River'), 229, 682, 563, -40),
    (78, _('Lateriquique River'), 228, 613, 610, -40),
    (79, _('Lake Titicaca'), 227, 47, 424, -45),
    (80, _('Lake Poopo'), 226, 180, 610, 0)
]

ROUTES = []

STATS = [
    (_('Capital:'), _('Sucre') + ' ' + _("(19º2' S - 65º15' W)")),
    (_('Language:'), _('Spanish')),
    ('', _('36 indigenous languages')),
    (_('Government:'), _('Presidential republic')),
    (_('President:'), _('Rodrigo Paz Pereira')),
    (_('Vice President:'), _('Edmand Lara')),
    (_('Independence:'), _('from Spain')),
    ('', _('declared: %s') % _('August 6, 1825')),
    ('', _('recognized: %s') % _('July 21, 1847')),
    (_('Area:'), '1 098 581' + ' ' + _('km²')),
    (_('Population:'), '12 581 843 (2025)'),
    (_('GDP:'), 'USD 64 770 000 000 (2025)'),
    (_('HDI:'), _('High') + ' - 0.733 (2023, #108)'),
    (_('Currency:'), _('Boliviano')),
    (_('Updated:'), '2026-09-25'),
]
