# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Argentina')

STATES = [
    (1, _('Jujuy'), 254, 306, 47, -45),
    (2, _('Salta'), 253, 320, 93, 0),
    (3, _('Formosa'), 252, 433, 80, -30),
    (4, _('Chaco'), 251, 429, 150, 0),
    (5, _('Misiones'), 250, 570, 150, 45),
    (6, _('Catamarca'), 249, 271, 152, -45),
    (7, _('Santiago del Estero'), 248, 359, 163, 45),
    (8, _('La Rioja'), 247, 270, 212, -45),
    (9, _('San Juan'), 246, 226, 251, 0),
    (10, _('Mendoza'), 245, 245, 349, 85),
    (11, _('Corrientes'), 244, 488, 193, 45),
    (12, _('Santa Fe'), 243, 419, 226, 70),
    (13, _('Córdoba'), 242, 347, 278, 90),
    (14, _('San Luis'), 241, 302, 327, 90),
    (15, _('Entre Ríos'), 240, 450, 286, 70),
    (16, _('Buenos Aires'), 239, 435, 404, 0),
    (17, _('La Pampa'), 238, 302, 417, 0),
    (18, _('Río Negro'), 237, 297, 493, 0),
    (19, _('Neuquén'), 236, 226, 466, 45),
    (20, _('Chubut'), 235, 265, 591, 0),
    (21, _('Santa Cruz'), 234, 260, 720, 45),
    (22, _('Tierra del Fuego'), 233, 394, 860, 0),
    (23, _('Falkland Islands'), 232, 423, 775, 0),
    (24, _('Tucumán'), 231, 312, 135, 0),
    (25, _('Brazil'), 230, 644, 142, 50),
    (26, _('Uruguay'), 229, 536, 322, 0),
    (27, _('Chile'), 228, 185, 395, 80),
    (28, _('Paraguay'), 227, 484, 46, -45)
]

CAPITALS = [
    (29, _('Buenos Aires'), 468, 346, 0, 35, -14),
    (30, _('Córdoba'), 345, 262, 1, 0, 14),
    (31, _('Catamarca'), 304, 187, 1, -65, 0),
    (32, _('Corrientes'), 472, 163, 1, 10, 14),
    (33, _('Formosa'), 482, 126, 1, 0, -14),
    (34, _('La Plata'), 481, 355, 1, 20, 14),
    (35, _('La Rioja'), 281, 214, 1, 0, 14),
    (36, _('Mendoza'), 242, 304, 1, 0, -14),
    (37, _('Neuquén'), 259, 459, 1, 15, -14),
    (38, _('Paraná'), 428, 272, 1, 10, 14),
    (39, _('Posadas'), 539, 166, 1, 20, -14),
    (40, _('Río Gallegos'), 263, 794, 1, 0, 14),
    (41, _('Rawson'), 331, 566, 1, 0, 14),
    (42, _('Resistencia'), 463, 158, 1, 0, -14),
    (43, _('Salta'), 311, 89, 1, 0, 14),
    (44, _('San Juan'), 246, 267, 1, 0, -14),
    (45, _('San Luis'), 295, 311, 1, -35, 14),
    (46, _('San Miguel de Tucumán'), 318, 143, 1, 0, -14),
    (47, _('San Salvador de Jujuy'), 312, 71, 1, 0, -14),
    (48, _('Santa Fe'), 420, 266, 1, 0, -14),
    (49, _('Santa Rosa'), 344, 396, 1, 0, 14),
    (50, _('Santiago del Estero'), 340, 166, 1, 30, 14),
    (51, _('Ushuaia'), 288, 871, 1, 0, -14),
    (52, _('Viedma'), 370, 508, 1, 0, 14)
]

CITIES = [
    (53, _('Bahía Blanca'), 386, 451, 2, -10, -14),
    (54, _('Comodoro Rivadavia'), 284, 635, 2, 0, -14),
    (55, _('Curuzú Cuatiá'), 483, 222, 2, 40, 14),
    (56, _('Esquel'), 210, 565, 2, 0, 14),
    (57, _('Gobernador Gregores'), 241, 717, 2, 0, 14),
    (58, _('General Villegas'), 371, 355, 2, 20, 14),
    (59, _('Junín'), 415, 345, 2, 5, -14),
    (60, _('Las Heras'), 259, 658, 2, 0, 14),
    (61, _('Mar del Plata'), 480, 432, 2, 20, -14),
    (62, _('Mercedes'), 319, 320, 2, 15, 14),
    (63, _('Necochea'), 458, 446, 2, 20, 14),
    (64, _('Puerto Deseado'), 318, 683, 2, 15, 14),
    (65, _('Puerto Santa Cruz'), 275, 749, 2, 0, 14),
    (66, _('Río Cuarto'), 341, 306, 2, 10, -14),
    (67, _('Rosario'), 419, 301, 2, 10, 14),
    (68, _('San Carlos de Bariloche'), 206, 519, 2, 0, 14),
    (69, _('San Rafael'), 255, 348, 2, 0, 14),
    (70, _('Santo Tomé'), 528, 189, 2, 20, 14),
    (71, _('Telén'), 317, 387, 2, -35, 0),
    (72, _('Zapala'), 227, 460, 2, -20, 14)
]

RIVERS = [
    (73, _('Negro River'), 254, 299, 479, -30),
    (74, _('Chubut River'), 253, 292, 571, 15),
    (75, _('Chico River'), 252, 255, 719, -40),
    (76, _('Deseado River'), 251, 259, 659, 0),
    (77, _('Colorado River'), 250, 333, 435, -30),
    (78, _('Salado River'), 249, 367, 144, -70),
    (79, _('Desaguadero River'), 248, 271, 265, -70),
    (80, _('Paraná River'), 247, 447, 194, 70),
    (81, _('Alto Paraná River'), 246, 568, 78, 70),
    (82, _('Uruguay River'), 245, 530, 209, 45),
    (83, _('Pilcomayo River'), 244, 426, 49, -30),
    (84, _('Bermejo River'), 243, 400, 92, -40),
    (85, _('Río de la Plata'), 242, 503, 357, 0),
    (86, _('San Blas Bay'), 241, 413, 489, 0),
    (87, _('San Matías Gulf'), 240, 348, 531, 0),
    (88, _('Atlantic Ocean'), 239, 584, 591, 0),
    (89, _('Pacific Ocean'), 238, 71, 338, 90)
]

ROUTES = []

STATS = [
    (_('Capital:'), _('Buenos Aires') + ' ' + _("(34º40' S - 58º24' W)")),
    (_('Language:'), _('Spanish')),
    (_('Government:'), _('Federal presidential republic')),
    (_('President:'), _('Javier Milei')),
    (_('Vice President:'), _('Victoria Villarruel')),
    (_('Independence:'), _('from Spain')),
    ('', _('declared: %s') % _('July 9, 1816')),
    ('', _('recognized: %s') % _('September 21, 1863')),
    (_('Area:'), '2 780 400' + ' ' + _('km²')),
    (_('Population:'), '45 851 378 (2025)'),
    (_('GDP:'), 'USD 683 100 000 000 (2025)'),
    (_('HDI:'), _('Very High') + ' - 0.865 (2023, #47)'),
    (_('Currency:'), _('Peso')),
    (_('Updated:'), '2026-09-25'),
]

