# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Cuba')

STATES = [
    (1, _('Pinar del Río'), 254, 105, 357, 30),
    (2, _('Havana'), 253, 213, 333, 0),
    (3, _('Cienfuegos'), 252, 324, 382, 0),
    (4, _('Matanzas'), 250, 275, 350, 0),
    (5, _('Sanctí Spiritus'), 249, 394, 404, 45),
    (6, _('Villa Clara'), 248, 357, 349, -30),
    (7, _('Camagüey'), 247, 505, 445, 0),
    (8, _('Ciego de Ávila'), 246, 450, 402, 45),
    (9, _('Guantánamo'), 245, 716, 529, 0),
    (10, _('Las Tunas'), 244, 572, 468, 45),
    (11, _('Granma'), 243, 577, 527, 0),
    (12, _('Santiago de Cuba'), 242, 616, 558, 0),
    (13, _('Holguín'), 241, 626, 484, 0),
    (14, _('Isla de la Juventud'), 240, 156, 447, 0),
    (15, _('Cayman Islands'), 239, 312, 581, 0),
    (16, _('United States'), 238, 308, 134, 0),
    (17, _('Andros Island'), 237, 501, 216, -60),
    (18, _('New Providence'), 236, 538, 154, -45),
    (19, _('Eleuthera'), 235, 599, 156, -45),
    (20, _('Cat Island'), 234, 665, 216, 0),
    (21, _('San Salvador'), 233, 716, 236, 0),
    (22, _('Great Exuma'), 232, 613, 273, -45),
    (23, _('Long Island'), 231, 690, 306, -45),
    (24, _('Crooked Island'), 230, 737, 329, -45),
    (25, _('Haiti'), 229, 754, 662, 90),
    (26, _('Jamaica'), 228, 545, 685, 0),
    (27, _('Honduras'), 227, 87, 857, 0),
    (28, _('Grand Bahama Island'), 226, 444, 68, 0),
    (29, _('Abaco Islands'), 225, 591, 48, 90)
]

CAPITALS = [
    (30, _('Havana'), 195, 311, 0, -30, -14),
    (31, _('Camagüey'), 502, 442, 1, 0, 14),
    (32, _('Ciego de Ávila'), 443, 408, 1, 60, 0),
    (33, _('Cienfuegos'), 327, 381, 1, -55, 0),
    (34, _('Guantánamo'), 696, 530, 1, 20, 14),
    (35, _('Holguín'), 619, 477, 1, 0, -14),
    (36, _('Las Tunas'), 570, 473, 1, 0, 14),
    (37, _('Manzanillo'), 561, 519, 1, -60, 0),
    (38, _('Matanzas'), 249, 316, 1, 15, -14),
    (39, _('Pinar del Río'), 100, 361, 1, 40, 14),
    (40, _('Sancti Spíritus'), 395, 392, 1, -40, 14),
    (41, _('Santa Clara'), 360, 364, 1, 25, -14),
    (42, _('Santiago de Cuba'), 651, 540, 1, 0, 14)
]

CITIES = [
    (43, _('Amancio'), 526, 484, 2, -20, -14),
    (44, _('Banes'), 657, 471, 2, 35, 0),
    (45, _('Baracoa'), 741, 514, 2, 10, 14),
    (46, _('Bayamó'), 592, 516, 2, 10, 14),
    (47, _('Cárdenas'), 274, 317, 2, 40, 0),
    (48, _('Florida'), 481, 430, 2, -45, 0),
    (49, _('Güines'), 217, 331, 2, -20, 14),
    (50, _('Guane'), 73, 380, 2, -10, 14),
    (51, _('Isabela de Sagua'), 354, 328, 2, 70, 0),
    (52, _('Jovellanos'), 275, 333, 2, 0, 14),
    (53, _('La Fe'), 164, 412, 2, 0, 14),
    (54, _('Mariel'), 156, 320, 2, -40, 0),
    (55, _('Mayarí'), 659, 493, 2, 0, 14),
    (56, _('Moa'), 711, 493, 2, 25, 0),
    (57, _('Morón'), 452, 387, 2, 35, 0),
    (58, _('Nueva Gerona'), 161, 403, 2, 0, -14),
    (59, _('Nuevitas'), 546, 428, 2, 40, 0),
    (60, _('Pilón'), 544, 551, 2, 0, 14),
    (61, _('Placetas'), 380, 372, 2, 45, 0),
    (62, _('Puerto Padre'), 595, 455, 2, 40, -14),
    (63, _('San Cristobal'), 144, 340, 2, -70, 0),
    (64, _('Santa Cruz del Sur'), 497, 490, 2, -85, 0)
]

ROUTES = []

STATS = [
    (_('Capital:'), _('Havana') + ' ' + _("(23º08' N - 82º23' W)")),
    (_('Language:'), _('Spanish')),
    (_('Government:'), _('Communist state')),
    (_('President:'), _('Miguel Díaz-Canel')),
    (_('Vice President:'), _('Salvador Valdés Mesa')),
    (_('Independence:'), _('from United States')),
    ('', _('May 20, 1902')),
    (_('Area:'), '110 860' + ' ' + _('km²')),
    (_('Population:'), '10 937 203 (2025)'),
    (_('GDP:'), 'USD 107 350 000 000 (2020)'),
    (_('HDI:'), _('High') + ' - 0.762 (2023, #97)'),
    (_('Currency:'), _('Cuban peso')),
    (_('Updated:'), '2026-09-25'),
]

