# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Dominicana')

STATES = [
    (1, _('Distrito Nacional'), 254, 453, 542, 0),
    (2, _('Altagracia'), 253, 706, 503, 45),
    (3, _('Azua'), 252, 265, 511, 0),
    (4, _('Bahoruco'), 251, 150, 521, -10),
    (5, _('Barahona'), 250, 175, 599, 60),
    (6, _('Dajabón'), 249, 99, 314, 0),
    (7, _('Duarte'), 248, 411, 368, -20),
    (8, _('Elías Piña'), 247, 89, 425, 70),
    (9, _('Espaillat'), 246, 345, 287, 60),
    (10, _('Hato Mayor'), 245, 561, 453, 90),
    (11, _('Independencia'), 244, 101, 548, -30),
    (12, _('María Trinidad Sánchez'), 243, 525, 318, 0),
    (13, _('Monseñor Nouel'), 242, 343, 441, 0),
    (14, _('Monte Cristi'), 241, 126, 261, 0),
    (15, _('Monte Plata'), 240, 472, 456, 0),
    (16, _('Pedernales'), 239, 107, 638, -50),
    (17, _('Peravia'), 238, 351, 569, 0),
    (18, _('Puerto Plata'), 237, 259, 252, -20),
    (19, _('La Romana'), 236, 640, 521, 45),
    (20, _('Salcedo'), 235, 351, 331, 60),
    (21, _('Samaná'), 234, 536, 363, 0),
    (22, _('San Cristobal'), 233, 399, 543, -60),
    (23, _('San Juan'), 232, 160, 450, 0),
    (24, _('San Pedro de Macorís'), 231, 560, 559, 45),
    (25, _('Sánchez Ramírez'), 230, 396, 413, 0),
    (26, _('Santiago'), 229, 249, 347, 45),
    (27, _('Santiago Rodríguez'), 228, 148, 339, 10),
    (28, _('El Seibo'), 227, 626, 458, 45),
    (29, _('Valverde'), 226, 213, 293, 0),
    (30, _('La Vega'), 225, 298, 400, 45),
    (31, _('San José de Ocoa'), 224, 318, 503, 60),
    (32, _('Santo Domingo'), 223, 456, 503, -15),
    (33, _('Haití'), 222, 37, 380, 0),
    (34, _('Beata Island'), 221, 113, 736, 0),
    (35, _('Saona Island'), 220, 700, 613, 0)
]

CAPITALS = [
    (36, _('Santo Domingo'), 451, 527, 0, 0, -14),
    (37, _('Azua de Compostela'), 278, 535, 1, -40, 14),
    (38, _('Bani'), 361, 572, 1, -5, 14),
    (39, _('Barahona'), 202, 586, 1, 0, 14),
    (40, _('Bonao'), 345, 428, 1, 0, 14),
    (41, _('Comendador'), 78, 443, 1, 10, -14),
    (42, _('Cotui'), 397, 403, 1, 20, 14),
    (43, _('Dajabon'), 82, 297, 1, 0, -14),
    (44, _('El Seibo'), 626, 466, 1, 15, -14),
    (45, _('Gaspar Hernández'), 373, 282, 1, 0, -14),
    (46, _('Hato Mayor'), 583, 468, 1, -10, 14),
    (47, _('Higuey'), 695, 498, 1, 20, -14),
    (48, _('Jimani'), 47, 526, 1, 0, 14),
    (49, _('La Romana'), 642, 537, 1, -10, -14),
    (50, _('La Vega'), 321, 369, 1, 0, 14),
    (51, _('Mao'), 207, 294, 1, 0, -14),
    (52, _('Moca'), 325, 331, 1, -25, 14),
    (53, _('Monte Cristi'), 91, 233, 1, 0, -14),
    (54, _('Monte Plata'), 475, 457, 1, 25, -14),
    (55, _('Nagua'), 459, 339, 1, 0, -14),
    (56, _('Neiba'), 135, 531, 1, 0, -14),
    (57, _('Pedernales'), 71, 622, 1, 0, 14),
    (58, _('Puerto Plata'), 285, 246, 1, 10, -14),
    (59, _('Sabaneta'), 151, 313, 1, 0, 14),
    (60, _('Salcedo'), 342, 335, 1, 25, -14),
    (61, _('San Cristóbal'), 405, 543, 1, -15, 14),
    (62, _('San Francisco de Macorís'), 376, 351, 1, 60, 14),
    (63, _('San José de Ocoa'), 327, 514, 1, -25, -14),
    (64, _('San Juan'), 175, 459, 1, 0, -14),
    (65, _('San Pedro de Macoris'), 572, 533, 1, -20, 14),
    (66, _('Santa Bárbara de Samaná'), 565, 371, 1, 60, 14),
    (67, _('Santiago'), 286, 320, 1, -20, -14)
]

CITIES = [
    (68, _('Boca de Yuma'), 713, 545, 2, -5, 14),
    (69, _('Duvenge'), 117, 458, 2, -10, 14),
    (70, _('Enriquillo'), 176, 647, 2, 10, -14),
    (71, _('Miches'), 625, 421, 2, -15, -14),
    (72, _('Oviedo'), 143, 675, 2, 0, 14),
    (73, _('Pedro Santana'), 80, 400, 2, 15, -14),
    (74, _('Punta Cana'), 769, 506, 2, -30, 14)
]

RIVERS = [
    (75, _('Yaque Norte River'), 254, 206, 275, -20),
    (76, _('Artibonito River'), 253, 75, 366, 60),
    (77, _('Macasia River'), 252, 84, 452, -40),
    (78, _('Yuna River'), 251, 415, 410, 30),
    (79, _('Camú River'), 250, 352, 360, -20),
    (80, _('Yaque Sur River'), 249, 234, 481, 80),
    (81, _('San Juan River'), 248, 170, 478, -60),
    (82, _('Lake Enriquillo'), 247, 90, 550, 0),
    (83, _('Ocoa River'), 246, 338, 524, -80),
    (84, _('Haina River'), 245, 388, 518, -45),
    (85, _('Ozama River'), 244, 458, 459, -60),
    (86, _('Yuma River'), 243, 708, 501, -65),
    (87, _('Chavón River'), 242, 656, 502, 70),
    (88, _('Soco River'), 241, 619, 458, 45),
    (89, _('Iguamo River'), 240, 575, 475, 65),
    (90, _('Caribbean Sea'), 239, 427, 741, 0),
    (91, _('Atlantic Ocean'), 238, 397, 143, 0)
]

ROUTES = []

STATS = [
    (_('Capital:'), _('Santo Domingo')),
    ('', _("(18º28' N - 69º54' W)")),
    (_('Language:'), _('Spanish')),
    (_('Government:'), _('Presidential republic')),
    (_('President:'), _('Luis Abinader')),
    (_('Vice President:'), _('Raquel Peña')),
    (_('Independence:'), _('February 27, 1844 (of Haiti)')),
    ('', _('1865 (from Spain)')),
    (_('Area:'), '48 442' + ' ' + _('km²')),
    (_('Population:'), '11 520 487 (2025)'),
    (_('GDP:'), 'USD 127 410 000 000 (2025)'),
    (_('HDI:'), _('High') + ' - 0.776 (2023, #89)'),
    (_('Currency:'), _('Peso')),
    (_('Updated:'), '2026-09-25'),
]
